var local_database = [
  {
    date: "Sep 16 2018",
    title: "火锅",
    imgSrc: "/images/post/huoguo.jpg",
    avatar: "/images/avatar/1.jpg",
    content: "火锅，古称“古董羹”，因食物投入沸水时发出的“咕咚”声而得名，它是中国独创的美食，历史悠久，是一种老少皆宜的食物。",
    collection: 57,
    reading: 112,
    postId:0,
    author:"黄建壮",
    dateTime:"三天前",
    detail: "火锅，古称“古董羹”，因食物投入沸水时发出的“咕咚”声而得名，它是中国独创的美食，历史悠久，是一种老少皆宜的食物。据考证，战国时期即有火锅，时人以陶罐为锅，到宋代，火锅的吃法在民间已十分常见，南宋林洪的《山家清供》食谱中，便有同友人吃火锅的介绍。元代，火锅流传到蒙古一带，用来煮牛羊肉。到清代，火锅不仅在民间流行，而且成了一道著名的“宫廷菜”，用料是山鸡等野味。典型的火锅食材包括各种肉类、海鲜类、蔬菜类、豆制品类、菌菇类、蛋类制品等，将其放入煮开的清水或特制的高汤锅底烫熟后食用。有些吃法还会蘸上调味料一起食用。",
    music: {
      url: "http://music.163.com/song/media/outer/url?id=472747752.mp3",
      title: "小城谣"
    }
  },
  {
    date: "Nov 09 2018",
    title: "比利·林恩的中场故事",
    imgSrc: "/images/post/bl.png",
    avatar: "/images/avatar/2.png",
    content: "李安是一位绝对不会重复自己的导演，本片将极富原创性，李安众所瞩目的新片《比利·林恩的中场故事》,正式更名为《半场无战事》",
    collection: 62,
    reading: 156,
    postId: 1,
    author: "章梓才",
    dateTime: "24小时前",
    detail: "《比利·林漫长的中场行走》根据本·芳汀同名小说改编，被认为是伊拉克战争版的“第22条军规”。故事主角是一名19岁的得克萨斯男孩比利·林，他在加入美军步兵部队后，被派往伊拉克战场。2005年他和同事们在一次交火中大难不死、逃过一劫。为了展示伊战成果，布什政府把他们召回国，让他们在感恩节那天的达拉斯牛仔队橄榄球比赛中场休息时与碧昂斯等娱乐明星同台，同时向他们授予荣誉勋章。不过在这之后，比利·林和其他的老兵又被布什政府重新送回到了伊拉克战场。" ,
    music: {
      url: "http://music.163.com/song/media/outer/url?id=1088157.mp3",
      title: "Let It Rain"
    }
  },
  {
    date: "Feb 23 2017",
    title: "鬼泣",
    imgSrc: "/images/post/guiqi.jpg",
    avatar: "/images/avatar/3.png",
    content: "传说，在2000年前，魔界与人间爆发了一场跨次元的战争。而就在这时，一位原本是魔界的剑士斯巴达，为了守护人类挺身而出，以一己之力，将魔界帝王打回了魔界，并封印了魔界与人间裂开的次元入口。 200年前，他与一名人类女子相爱，并有了一对双胞胎。",
    collection: 879,
    reading: 958,
    postId: 2,
    author: "君往何处",
    dateTime: "七天前",
    detail: "……世界自黑暗而生，无尽的黑暗与荒凉的土地。但是…在那个世界里是有一缕光照耀着。世界之后被分成两个部分，暗之区域是魔界(Demon World) ，光之区域是人界(Human World) 。在这很长的一段时光里，这两个世界一直互相平衡，并存着，原本应该这样下来。但是，暗界之王却说“世界原来是一体的，那么将其完整有什么不好”。于是从那次起，黑暗预要笼罩光明，光明则抗争着要从黑暗的魔爪逃脱。但光之界的居民--人类，他们的身躯是脆弱的，无法与魔界居民--恶魔的力量对抗，就在光中的生气要被深沉黑暗即将啃噬殆尽之时，命运之轮启动了……",
    music: {
      url: "http://music.163.com/song/media/outer/url?id=4884864.mp3",
      title: "僕らのつづき"
    }
  },
  {
    date: "Aug 30 2018",
    title: "进击的巨人",
    imgSrc: "/images/post/juren.jpg",
    avatar: "/images/avatar/4.png",
    content: "曾几何时，世界上突然出现无数身形庞大的巨人，普通人类的生命受到前所未有的威胁。为了保护自身安全，最后的人类筑起三座高墙：玛莉亚、露丝和希娜。人类迎来了长达一个世纪的和平岁月，却也让自己成为圈养在笼中的鸟儿，屈辱地失去自由。",
    collection: 999,
    reading: 999,
    postId: 3,
    author: "桃之妖妖",
    dateTime: "一小时前",
    detail: "曾几何时，世界上突然出现无数身形庞大的巨人，普通人类的生命受到前所未有的威胁。为了保护自身安全，最后的人类筑起三座高墙：玛莉亚、露丝和希娜。人类迎来了长达一个世纪的和平岁月，却也让自己成为圈养在笼中的鸟儿，屈辱地失去自由。845年，高达60米的超大型巨人和铠之巨人登场， 摧毁了最外层的玛莉亚之壁，也惊醒了人类似乎永远不会苏醒的长梦。在此事件中，不愿蜷缩在墙内的少年艾伦·耶格尔）亲眼目睹母亲遇害，由此更坚定了他加入调查兵团的决心。在此之后，艾伦和青梅竹马三笠·阿克曼、好友阿尔敏·亚鲁雷特（井上麻里奈 配音）加入第104期训练兵团，发誓成为足以消灭所有巨人的英勇战士。百年的和平结束，人类和巨人的战争再度拉开序幕…",
    music: {
      url: "http://music.163.com/song/media/outer/url?id=29095230.mp3",
      title: "ツナ覚醒"
    }
  },
  {
    date: "Nov 20 2017",
    title: "从视觉到触觉,这款vr手套能给你真实触感",
    imgSrc: "/images/post/vr.png",
    avatar: "/images/avatar/5.png",
    content: "8月29日消息，据国外媒体VentrueBeat报道，一家名为Dexta Roobtics的公司最近发布了一款新型的vr手套，这款手套搭载最新的处理器与芯片，能给用户带来不一样的体验。",
    collection: 26,
    reading: 102,
    postId: 4,
    author: "林间有风",
    dateTime: "三天前",
    detail: "当前三大VR平台都拥有自己的VR输入交互设备，比如HTC拥有基于Lighthouse追踪功能的HTC Vive手柄，索尼拥有PS Move手柄，Oculus的Touc手柄也即将到来。大家发现没有，这三款输入设备均为手柄，虽然能够让用户灵活的操作虚拟世界，但无无法触摸它。Dexta Robotics最新研发的VR / AR专用手套Exoskeleton Glove将从触感上秒杀官方手柄，戴上它之后，虚拟现实世界不再只能看，它还摸得到，你可以通过指尖感知到虚拟物品的尺寸、形状和软硬度。这一点主要是通过Dexmo公司的动态把握-处理软件实现，该软件能够提供经过计算的可变的力量反馈，手套将力作用于用户指尖，用户便能够感觉虚拟物体，仿佛触摸真实物体。",
    music: {
      url: "http://music.163.com/song/media/outer/url?id=28593339.mp3",
      title: "Sunshine Girl"
    }
  },
  {
    title: "微信·小程序开发工具安装指南",
    content: "这两天闲来无事，也安装了 “微信折叠”的开发工具来玩一下。以下是一些小道消息及使用体验，过两天我会写一篇文章以开发者的角度来详细评价微信小程序",
    imgSrc: "/images/post/xiaolong.jpg",
    reading: 102,
    detail: "这两天闲来无事，也安装了 “微信折叠”的开发工具来玩一下。以下是一些小道消息及使用体验，过两天我会写一篇文章以开发者的角度来详细评价微信小程序:微信小程序不能开发游戏类、直播类功能，小程序每个人关注的上限是20个（还不确定，不过我相信这是真的，这次公布的API里并没有视频组件。微信太大，苹果要有所顾忌，但是微信也要做出相应的让步)微信目前有没有同苹果商谈好，还是个未知数，毕竟会对AppStore有一定的冲击。抛弃了大量的javascript组件后，这个生态体系变得相当的封闭，微信解释肯定是：为了更好的性能提升。那么我们拭目以待。小程序的入口是微信里的三级菜单，就是在“Tab栏发现里的游戏下面加入一个“小程序”。反正，这一栏里的购物和游戏我是从来没点进去过的。以腾讯的尿性，小程序同服务号一样，其关系链及重要功能的开放程度会因“人”而异。对，优质的接口只会开放给腾讯的儿子们（滴滴呀、京东呀）",
    collection: 92,
    dateTime: "24小时前",
    author: "猫是猫的猫",
    date: "Nov 20 2016",
    avatar: "/images/avatar/5.png",
    postId: 5,
    music: {
      url: "http://music.163.com/song/media/outer/url?id=410629777.mp3",
      title: "EYES, NOSE, LIPS "
    }
  },
  {
    title: "爱奇艺创维开展战略合作，合力布局开放娱乐生态",
    content: "爱奇艺和创维分别作为国内领先的在线视频品牌",
    imgSrc: "/images/iqiyi.png",
    reading: 96,
    detail: "爱奇艺和创维分别作为国内领先的在线视频品牌和家电品牌。双方一直锐意创新，为用户提供优质的服务体验和产品体验。据悉，爱奇艺与创维将展开从资本到VIP会员服务等各方面的深入合作。籍由此次合作，爱奇艺将战略投资创维旗下拥有高端互联网电视品牌的酷开公司。从下一财年开始，创维旗下互联网电视将通过银河互联网电视集成播控平台，预置VIP会员服务及相关内容。这种捆绑终端与VIP内容的全新销售模式，将大幅提升互联网电视终端用户的体验，给予用户更多优质内容的选择。",
    collection: 26,
    dateTime: "21小时前",
    author: "深白色",
    date: "Nov 20 2016",
    avatar: "/images/avatar/2.png",
    postId: 6,
    music: {
      url: "http://music.163.com/song/media/outer/url?id=479408180.mp3",
      title: "船"
    }
  }

]

module.exports = {
  postList: local_database
}